icoFoamYadeGeometryIssueCohesion/system/controlDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     icoFoamYade;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         10;

deltaT          1e-05;

//writeControl    timeStep;
writeControl    adjustableRunTime;

//writeInterval   50;
writeInterval   0.1;

purgeWrite      0;

writeFormat     ascii;

writePrecision  6;

writeCompression on;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;


// ************************************************************************* //
