icoFoamYadeGeometryIssueCohesion/constant/transportProperties

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
/* transportModel Newtonian; */ 

nu              [0 2 -1 0 0 0 0] 1.74e-05;//1e-04;
partDensity     [1 -3 0 0 0 0 0] 50; 
fluidDensity    [1 -3 0 0 0 0 0] 1.2; 


// ************************************************************************* //
