icoFoamYadeGeometryIssueCohesion/0/U

FoamFile
{
	version     2.0;
	format      ascii;
	class       volVectorField;
	object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (50 0 0);

boundaryField
{
	wall
	{
		type            fixedValue;
		value           uniform (0 0 0);
	}
	inlet
	{
		type            cyclic;
	}
	outlet
	{
		type            cyclic;
	}
}

// ************************************************************************* //
